#Создайте скрипт (data.py), который бы спрашивал пользователя его имя, возраст, место жительства. А потом выводил бы 3 строки: There is имя; It is возраст; He live in место жительства. Здесь вместо вложений должны быть данные, введенные пользователем.

userName = input('Введите Ваше имя: ')
userAge = input('Введите Ваш возраст: ')
userAdress = input('Введите место Вашего проживания: ')

print("This is", userName)
print("It is", userAge)
print("He live in", userAdress)
