#Определите строку не менее 8 символов и выведите на экран с этой строки: первый символ, последний символ, третий с начала и третий с конца строки.

print("Введіть рядок не менше ніж з 8 символів: ")
s=str(input())
length=len(s)
first=s[0]
last=s[-1]
thstart=s[2]
thend=s[-3]
print
print ("Перший символ: " + first)
print ("Останній символ: " + last)
print ("Третій символ з початку: " + thstart)
print ("Третій символ з кінця: " + thend)
